[
  {
    "title": "کھانے سے پہلے کی دعا",
    "dua": "بِسْمِ اللّٰہِ وَعَلٰی بَرَكَةِ اللّٰہِ",
    "en": "In the name of Allah and with the blessings of Allah I begin (eating)",
    "ur": "میں نے الله کے نام کے ساتھ اور الله کی برکت پر کھانا شروع کیا"
  },
  {
    "title": "کھانے کے بعد کی دعا",
    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِينَ",
    "en": "Thanks to Allah Azzawajal who fed us and made us among Muslims",
    "ur": "اللہ عزوجل کا شکر ہے جس نے ہمیں کھلایا پلایا اور مسلمانوں میں سے بنایا۔"
  },
  {
    "title": "سوتے وقت کی دعا",
    "dua": "اَللّٰھُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
    "en": "O Allah (Almighty) I live and die in your name.",
    "ur": "الٰہی عزوجل میں تیرے نام پر مرتا ہوں اور جیتا ہوں۔"
  },
  {
    "title": "نیند سے بیدار ہونے کی دعا",
    "dua": "الْحَمْدُ لِلّٰہِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "en": "All Praise onto Allah (Almighty) Who granted us life after death (Sleep) and we are return to him.",
    "ur": "تمام تعریفیں اللہ عزوجل کے لئے جس نے ہمیں موت (نیند) کے بعد حیات (بیداری) عطا فرمائی اور ہمیں اسی طرف لوٹنا ہے۔"
  },
  {
    "title": "گھر میں داخل ہوتے وقت کی دعا",
    "dua": "اَللّٰھُمَّ اِنِّیْ اَسْئَلُكَ خَیْرَالْمَوْلَجِ وَخَیْرَالْمَخْرَجِ",
    "en": "O Allah(عَزَّ وَجَلَّ)! I ask you for the goodness of the places of entering and exiting.",
    "ur": "اے اللہ عَزَّ وَجَلَّ ! میں تجھ سے داخل ہونے اور نکلنے کی جگہوں کی بھلائی طلب کرتا ہوں ۔"
  },
  {
    "title": "گھر سے نکلتے وقت کی دعا",
    "dua": "بِسْمِ اللّٰہِ تَوَكَّلْتُ عَلَى اللّٰہِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰہِ",
    "en": "In the name of Allah Almighty (I comeout of my house) I trust Allah Almighty, there is no capability of saving oneself from sins and neither is there capability to do good deeds but from Allah Almighty.",
    "ur": "اللہ عزوجل کے نام سے (گھر سے نکلتا ہوں) میں نے اللہ عزوجل پر بھروسہ کیا اللہ عزوجل کے بغیر نہ طاقت ہے (گناہوں سے بچنےکی) اور نہ وقت ہے (نیکیاں کرنے کی)۔"
  },
  {
    "title": "مسجد میں داخل ہونے کی دعا",
    "dua": "اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِکَ.",
    "en": "Oh Allah! Open the doors for me of your Blessings.",
    "ur": "اے اللہ! میرے لیے رحمت کے دروازے کھول دے۔"
  },
  {
    "title": "مسجد سے نکلنے کی دعا",
    "dua": "اَللّٰهُمَّ اِنِّيْ اَسْاَلُکَ مِنْ فَضْلِکَ وَرَحْمَتِکَ",
    "en": "Oh Allah! I ask you of your Favour",
    "ur": "اے اللہ! میں تجھ سے تیرا فضل اور تیری رحمت مانگتا ہوں۔"
  },
  {
    "title": "سفر اور سواری کی دعا",
    "dua": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
    "en": "Thanks to Allah Azzawajal. Pure is he who subdude this, other wise we could not make this obedient",
    "ur": "اللہ عزوجل کا شکر ہے، پاک ہے وہ جس نے ہمارے لئے اس(سواری کو) مسخر کیا اور ہم اس کو فرمانبردار نہیں بنا سکتے تھے۔"
  },
  {
    "title": "بازار میں داخل ہوتے وقت کی دعا",
    "dua": "لَا إِلٰهَ إِلَّا اللّٰہُ وَحْدَهٗ لَا شَرِيكَ لَهٗ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰی كُلِّ شَيْءٍ قَدِيرٍ",
    "en": "There is no deity except Allah Azzawajal he is unique, He has no partner, His is the kingship, and for him is praise, he brings to lie and he kills, He is alive(as such death will not come to him. All virtues are in his hand of power, He can do what ever he wants.",
    "ur": "اللہ عزوجل کے سوا کوئی معبود نہین، وہ یکتا ہے، اس کا کوئی شریک نہیں، اس کی بادشاہت ہے اور اسی کے لئے حمد ہے وہی جلاتا اور مارتا ہےوہ (ایسا) زندہ ہے جسے موت نہیں، تمام بھلائیاں اسی کے دست قدرت میں ہیں اور وہ ہر چیز پر قادر ہے۔"
  },
  {
    "title": "ملاقات کے وقت کی دعا",
    "dua": "اَلسَّلَامُ عَلَيْكُمُ - وَعَلَيْكُمُ السَّلَامُ",
    "en": "Peace be upon you And peace be upon you too.",
    "ur": "تم پر سلامتی ہو۔ اور تم پر بھی سلامتی ہو"
  },
  {
    "title": "چھینک آنے کے وقت کی دعا",
    "dua": "اَلْحَمْدُ لِلّٰہِ",
    "en": "All praise onto Allah Almighty.",
    "ur": "تمام تعریفیں اللہ عزوجل کےلئے ہیں۔"
  },
  {
    "title": "چھینک آنے پر الحمد للہ کہنے والے کے لئے دعا",
    "dua": "يَرْحَمُكَ اللّٰہُ",
    "en": "May Allah Almighty Have Mercy on you.",
    "ur": "اللہ عزوجل تجھ پر رحم کرے۔"
  },
  {
    "title": "مصیبت و پریشانی کے وقت کی دعا",
    "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُوْن. اَللّٰهُمَّ أْجُرْنِيْ فِيْ مُصِيبَتِيْ وَاخْلُفْ لِيْ خَيْرا مِنْهَا",
    "en": "To Allaah we belong and unto Him is our return. O Allaah, recompense me for my affliction and replace it for me with something better",
    "ur": "يقینا ہم اللہ ہى كى ملكيت ہیں اور اسى كى طرف لوٹ كر جانے والے ہیں۔اے اللہ مجھے ميرے اس صدمے یا تكليف كا اجر دے اور بدلے ميں مجھے اس سے زيادہ بہتر دے۔(صحیح مسلم)"
  },
  {
    "title": "مصیبت کے وقت ورد کرنا",
    "dua": "لَا إِلٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "en": "None has the right to be worshiped except You. How perfect You are, verily I was among the wrong-doers",
    "ur": "تیرے علاوہ کوئی سچا معبود نہیں، تو پاک ہے، یقینا میں ہی ظالموں میں سے ہوں۔"
  },
  {
    "title": "لباس پہنتے وقت کی دعا",
    "dua": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلَا قُوَّةٍ",
    "en": "All excellencies are for Allah Azzawajal Who gave me this cloth to wear and granted me without (using) any strenfth and Power.",
    "ur": "تمام خوبیاں اللہ عزوجل کے لئے جس نے مجھ کو یہ کپڑا پہنایا اور میری قوت و طاقت کے بغیر مجھ کو عطا فرمایا۔"
  },
  {
    "title": "عیادت کرتے وقت کی دعا",
    "dua": "لَا بَأْسَ طَهُورٌ إِنْ شَآءَ اللّٰہُ",
    "en": "This is not a thing of harm In Sha Allah Azzawajal this illness purifies from sins",
    "ur": "کوئی حرج کی بات نہیں انشاء اللہ عزوجل یہ مرض گناہوں سے پاک کرنے والا ہے"
  },
  {
    "title": "بیت الخلاء میں داخل ہونے سے پہلے کی دعا",
    "dua": "اَللّٰھُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "en": "O Allah (Almighty) I seek your refuge from impure Jinnat (male and female)",
    "ur": "اے اللہ عزوجل میں ناپاک جنوں (نرو مادہ) سے تیری پناہ مانگتا ہوں۔"
  },
  {
    "title": "بیت الخلاء سے باہر آنے کے بعد کی دعا",
    "dua": "اَلْحَمْدُ لِلّٰہِ الَّذِي أَذْهَبَ عَنِّي الْأَذَى وَعَافَانِي",
    "en": "Thanks to Allah Almighty Who removed pain from me and granted me relief.",
    "ur": "اللہ عزوجل کا شکر ہے جس نے مجھ سے اذیت دور کی اور مجھے عافیت دی۔"
  },
  {
    "title": "مصیبت ذدہ کو دیکھتے وقت کی دعا",
    "dua": "اَلْحَمْدُ لِلّٰہِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهٖ وَفَضَّلَنِي عَلٰی كَثِيرِ مِمَّنْ خَلَقَ تَفْضِيلَاً",
    "en": "Thanks to Allah Azzawajal who granted me relief from this affliction, which you have been involved in, and grant me greatness over a lot of your creatures.",
    "ur": "اللہ عزوجل کا شکر ہے جس نے مجھے اس مصیبت سے عافیت دی، جس میں تجھے مبتلا کیا، اور مجھے اپنی بہت سی مخلوق پر فضیلت دی۔"
  },
  {
    "title": "دودھ پینے کے بعد کی دعا",
    "dua": "اَللّٰهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
    "en": "O Allah Azzawajal give us abundance in this and grant us more then this.",
    "ur": "یا الٰہی عزوجل ہمارے لئے اس میں برکت دے اور ہمیں اس سے زیادہ عنایت فرما۔"
  },
  {
    "title": "دعوت کھانے کے بعد کی دعا",
    "dua": "اَللّٰهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي وَاسْقِ مَنْ سَقَانِي",
    "en": "O Allah Azzawajal feed him who fed me and give him to drink who gave to drink.",
    "ur": "یا الٰہی عزوجل اس کو کھلا جس نے مجھے کھلایا اور کو پلا جس نے مجھے پلایا۔"
  },
  {
    "title": "کسی قوم سے خطرے کی دعا",
    "dua": "اَللّٰهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
    "en": "O Allah, we make you the turner of the (enemies) chest (heart) and seek refuge in You from their evils",
    "ur": "اے اللہ عزوجل ہم ان (کفار و مشرکین) کے مقابل تجھے کرتے ہیں اور ان کے شر سے تیری پناہ لیتے ہیں۔"
  },
  {
    "title": "نیا عمامہ یا نئی چادر پہنتے وقت کی دعا",
    "dua": "اَللّٰهُمَّ لَكَ الْحَمْدُ كَمَا كَسَوْتَنِيهِ أَسْأَلُكَ خَيْرَهٗ وَخَيْرَ مَا صُنِعَ لَهٗ وَأَعُوذُ مِنْ شَرِّهٖ وَشَرِّ مَا صُنِعَ لَهٗ",
    "en": "O Allah Azzawajal, All praise is for you only, you have made me wear( this sheet of cloth or turban) and I ask you for it's goodness, and the goodness of that thing for which It has been made, and I ask you for your refuge from it's badness and badness of that thing for which it has been made.",
    "ur": "یا للہ عزوجل ، تمام تعریفیں تیرے ہی لئے ہیں تو نے ہی مجھے (یہ چادر یا عمامہ) پہنایا ہے اور میں تجھ سے اس کی بھلائی طلب کر تا ہوں اور اس چیز کی بھلائی جس کے لئے یہ بنایا گیا ہے اور میں اس کےشر سے تیری پناہ مانگتا ہوں اور اس چیز کے شر سے بھی جس کے لئے اس کو بنایا گیا۔"
  },
  {
    "title": "قبرستان میں داخل ہوتے وقت کی دعا",
    "dua": "السَّلَامُ عَلَيْكُمُ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمُ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ",
    "en": "O dwellers of the graves peace be upon you. May Allah Azzawajal forgive us and you. You reached before us and we will follow behind you.",
    "ur": "اے قبر والوں تم پر سلام ہو۔ اللہ عزوجل ہماری اور تمہاری مغفرت فرما۔ اور تم ہم سے پہلے پہنچ گئے اور ہم پیچھے آنےوالے ہیں۔"
  },
  {
    "title": "نکاح کے بعد دولہا اور دلہن کے لئے دعا",
    "dua": "بَارَكَ اللّٰہُ لَكَ وَبَارَكَ عَلَيْكُمَا وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    "en": "Allah Azzwajal bless you and shower (send) blessing on you and place, goodness between both of you.",
    "ur": "اللہ عزوجل تجھ کو برکت دے اور تجھ پر برکت نازل فرمائے اور تم دونوں میں بھلائی رکھے۔"
  },
  {
    "title": "نیا چاند دیکھتے وقت کی دعا",
    "dua": "اَللّٰهُمَّ أَهِلَّهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ وَالتَّوْفِيقِ لِمَا تُحِبُّ وَتَرْضیٰ رَبِّي وَرَبُّكَ اللّٰہُ",
    "en": "O Allah Azzawajal make this moon come out on us with blessings and with Iman and peace and Islam and make it come out with the ability of that thing which pleases you and that you like, (O moom of the first night my and your Lord is Allah Azzawajal).",
    "ur": "یا الٰہی عزوجل اس چاند کو ہم پر برکت کے ساتھ اور ایمان و سلامتی اور اسلام اور اس چیز کی توفیق کے ساتھ نکال جس سے تو راضی ہوتا ہے اور پسند کرتا ہے، (اے پہلی رات کے چاند) میرا اور تیرا رب اللہ عزوجل ہے۔"
  },
  {
    "title": "روزہ رکھنے کی نیت",
    "dua": "وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ.",
    "en": "I Intend to keep the fast for month of Ramadan",
    "ur": "اورمیں نے ماہ رمضان کے کل کے روزے کی نیت کی."
  },
  {
    "title": "روزہ افطار کرنے کے بعد کی دعا",
    "dua": "اَللّٰهُمَّ اِنِّی لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ",
    "en": "O Allah! I fasted for you and I believe in you and I put my trust in You and I break my fast with your sustenance.",
    "ur": "اے اللہ!میں نے تیری خاطر روزہ رکھا اور تیرے اوپر ایمان لایا اور تجھ پر بھروسہ کیا اورتیرے رزق سے اسے کھول رہا ہوں۔"
  },
  {
    "title": "آئنہ دیکھتے وقت کی دعا",
    "dua": "اَللّٰهُمَّ أَنْتَ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "en": "O Allah Azzawajal as you made my outward appearance good make my character good too.",
    "ur": "اللہ عزوجل تو نے میری صورت اچھی بنائی تو میری سیرت (اخلاق) بھی اچھی کردے۔"
  },
  {
    "title": "درد اور بخار کی دعا",
    "dua": "بِسْمِ اللَّهِ الْكَبِيرِ أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ كُلِّ عَرَقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ",
    "en": "I seek relief taking Allah's great blessed name from all the evils of pulling (pulsating) nerves and from the evils of the hot fire",
    "ur": "شروع اللہ کے نام سے جو کبریائی والا ہے اور میں اس اللہ کی پناہ میں آتا ہوں جو عظمت والا ہے پھڑکتی رگ اور آگ کی گرمی سے"
  }
]